{"title":"Joe King the EXORCIST of ale.","id":2,"author":"Joe King","exerpt":"Thalorin Lightweaver, a name whispered with reverence and awe throughout the mystical realms, is a dark...","image":"banjo-3092285_640-1.png","imageAlt":"","dateFirstPublished":1696676806,"dateLastModified":1696676806,"entries":["In the realm of fantasy and music, there's a bard who stands out from the rest, known for his wit, charm, and a wild tale of survival. Meet Joe King, the leader of the renowned band, “The Rusty Saw.”","With his long, flowing blonde hair reminiscent of sunbeams, Joe King is more than just a bard; he's a maestro of merriment. Whenever he enters a tavern or takes the stage at a festival, he becomes an instant spectacle. His music possesses the magical power to make even the grumpiest souls start tapping their feet to the rhythm of life. But there's a twist to Joe's story that sets him apart.","Joe's incredible journey began on a fateful night when he faced a Zombie Beholder, a fearsome creature that could defeat the bravest of warriors. It was a life-or-death battle that left Joe teetering on the edge of the afterlife. However, fate had other plans. In a bizarre turn of events, the Beholder's menacing gaze granted him a unique gift: wild sorcery.","Now, Joe King combines his musical talents with his newfound magical abilities, creating spells that are as unpredictable as they are amusing. Fireballs might turn into cascades of glitter, or simple tricks can transform into symphonies of rubber chickens. He's a living carnival of magical mayhem, captivating audiences with his whimsical wizardry.","But Joe's appeal extends beyond his magical talents. He's renowned for his way with the ladies, using his silver tongue and heartwarming melodies to leave countless admirers smitten.","Get ready to embark on a whimsical journey through Joe King and The Rusty Saw's enchanting world, where laughter, music, and magic blend in a tale as unpredictable as it is uproarious."],"comments":[{"postID":2,"commentID":1,"depth":1,"author":"Izzy","avatar":"default","datePosted":1697446230,"comment":["Wow Joe king sounds like an amazing character!","Definitely a great idea for an NPC for my campaign."]}]}